; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v2 ?v5)
             (pred_9 ?v7 ?v10)
             (pred_4 ?v2 ?v10)
             (pred_11 ?v3 ?v2 )
	     (pred_1 ?v2)
             (pred_5 ?v6)
             (pred_3 ?v7)
             (pred_12 ?v10)
             (pred_6 ?v2)
             (pred_10 ?v7)
             (pred_2 ?v2)
             (pred_7 ))



(:action op_5
:parameters (?v13 ?v11 ?v12 ?v9)
:precondition (and (pred_5 ?v13) (pred_5 ?v11) (pred_3 ?v12) (pred_12 ?v9)
          (pred_8 ?v13 ?v11) (pred_9 ?v12 ?v9)
                   (pred_4 ?v11 ?v9) (pred_1 ?v13) 
                   (pred_6 ?v11) (pred_10 ?v12))
:effect (and  (pred_2 ?v11) (not (pred_6 ?v11))))


(:action op_4
:parameters (?v13 ?v8)
:precondition (and (pred_5 ?v13) (pred_5 ?v8)
               (pred_1 ?v13) (pred_8 ?v13 ?v8) (pred_2 ?v8))
:effect (and (pred_1 ?v8) (not (pred_1 ?v13))))

(:action op_2
:parameters (?v13 ?v12)
:precondition (and (pred_5 ?v13) (pred_3 ?v12) 
                  (pred_1 ?v13) (pred_11 ?v12 ?v13) (pred_7 ))
:effect (and (pred_10 ?v12)
   (not (pred_11 ?v12 ?v13)) (not (pred_7 ))))


(:action op_1
:parameters (?v13 ?v4 ?v1)
:precondition (and (pred_5 ?v13) (pred_3 ?v4) (pred_3 ?v1)
                  (pred_1 ?v13) (pred_10 ?v1) (pred_11 ?v4 ?v13))
:effect (and (pred_10 ?v4) (pred_11 ?v1 ?v13)
        (not (pred_10 ?v1)) (not (pred_11 ?v4 ?v13))))

(:action op_3
:parameters (?v13 ?v12)
:precondition (and (pred_5 ?v13) (pred_3 ?v12) 
                  (pred_1 ?v13) (pred_10 ?v12))
:effect (and (pred_7 ) (pred_11 ?v12 ?v13) (not (pred_10 ?v12)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_22 obj_07 obj_25 obj_11 obj_10 obj_26 obj_20 obj_16 obj_15 obj_14 obj_06 obj_18 obj_29 obj_08 obj_04 obj_01 obj_17 obj_05 obj_12 obj_28 obj_24 obj_13 obj_23 obj_21 obj_02
    obj_30 obj_03
    obj_19 obj_27 obj_09
    )

    (:init
       (pred_7)

       (pred_5 obj_22)
       (pred_5 obj_07)
       (pred_5 obj_25)
       (pred_5 obj_11)
       (pred_5 obj_10)
       (pred_5 obj_26)
       (pred_5 obj_20)
       (pred_5 obj_16)
       (pred_5 obj_15)
       (pred_5 obj_14)
       (pred_5 obj_06)
       (pred_5 obj_18)
       (pred_5 obj_29)
       (pred_5 obj_08)
       (pred_5 obj_04)
       (pred_5 obj_01)
       (pred_5 obj_17)
       (pred_5 obj_05)
       (pred_5 obj_12)
       (pred_5 obj_28)
       (pred_5 obj_24)
       (pred_5 obj_13)
       (pred_5 obj_23)
       (pred_5 obj_21)
       (pred_5 obj_02)
       (pred_12 obj_30)
       (pred_12 obj_03)
       (pred_3 obj_19)
       (pred_3 obj_27)
       (pred_3 obj_09)

       (pred_8 obj_22 obj_26)
       (pred_8 obj_22 obj_07)
       (pred_8 obj_07 obj_20)
       (pred_8 obj_07 obj_25)
       (pred_8 obj_07 obj_22)
       (pred_8 obj_25 obj_16)
       (pred_8 obj_25 obj_11)
       (pred_8 obj_25 obj_07)
       (pred_8 obj_11 obj_15)
       (pred_8 obj_11 obj_10)
       (pred_8 obj_11 obj_25)
       (pred_8 obj_10 obj_14)
       (pred_8 obj_10 obj_11)
       (pred_8 obj_26 obj_06)
       (pred_8 obj_26 obj_20)
       (pred_8 obj_26 obj_22)
       (pred_8 obj_20 obj_18)
       (pred_8 obj_20 obj_16)
       (pred_8 obj_20 obj_07)
       (pred_8 obj_20 obj_26)
       (pred_8 obj_16 obj_29)
       (pred_8 obj_16 obj_15)
       (pred_8 obj_16 obj_25)
       (pred_8 obj_16 obj_20)
       (pred_8 obj_15 obj_08)
       (pred_8 obj_15 obj_14)
       (pred_8 obj_15 obj_11)
       (pred_8 obj_15 obj_16)
       (pred_8 obj_14 obj_04)
       (pred_8 obj_14 obj_10)
       (pred_8 obj_14 obj_15)
       (pred_8 obj_06 obj_01)
       (pred_8 obj_06 obj_18)
       (pred_8 obj_06 obj_26)
       (pred_8 obj_18 obj_17)
       (pred_8 obj_18 obj_29)
       (pred_8 obj_18 obj_20)
       (pred_8 obj_18 obj_06)
       (pred_8 obj_29 obj_05)
       (pred_8 obj_29 obj_08)
       (pred_8 obj_29 obj_16)
       (pred_8 obj_29 obj_18)
       (pred_8 obj_08 obj_12)
       (pred_8 obj_08 obj_04)
       (pred_8 obj_08 obj_15)
       (pred_8 obj_08 obj_29)
       (pred_8 obj_04 obj_28)
       (pred_8 obj_04 obj_14)
       (pred_8 obj_04 obj_08)
       (pred_8 obj_01 obj_24)
       (pred_8 obj_01 obj_17)
       (pred_8 obj_01 obj_06)
       (pred_8 obj_17 obj_13)
       (pred_8 obj_17 obj_05)
       (pred_8 obj_17 obj_18)
       (pred_8 obj_17 obj_01)
       (pred_8 obj_05 obj_23)
       (pred_8 obj_05 obj_12)
       (pred_8 obj_05 obj_29)
       (pred_8 obj_05 obj_17)
       (pred_8 obj_12 obj_21)
       (pred_8 obj_12 obj_28)
       (pred_8 obj_12 obj_08)
       (pred_8 obj_12 obj_05)
       (pred_8 obj_28 obj_02)
       (pred_8 obj_28 obj_04)
       (pred_8 obj_28 obj_12)
       (pred_8 obj_24 obj_13)
       (pred_8 obj_24 obj_01)
       (pred_8 obj_13 obj_23)
       (pred_8 obj_13 obj_17)
       (pred_8 obj_13 obj_24)
       (pred_8 obj_23 obj_21)
       (pred_8 obj_23 obj_05)
       (pred_8 obj_23 obj_13)
       (pred_8 obj_21 obj_02)
       (pred_8 obj_21 obj_12)
       (pred_8 obj_21 obj_23)
       (pred_8 obj_02 obj_28)
       (pred_8 obj_02 obj_21)
       (pred_6 obj_05)
       (pred_6 obj_11)
       (pred_6 obj_28)
       (pred_4  obj_05 obj_30)
       (pred_4  obj_11 obj_03)
       (pred_4  obj_28 obj_30)
       (pred_2 obj_22)
       (pred_2 obj_07)
       (pred_2 obj_25)
       (pred_2 obj_10)
       (pred_2 obj_26)
       (pred_2 obj_20)
       (pred_2 obj_16)
       (pred_2 obj_15)
       (pred_2 obj_14)
       (pred_2 obj_06)
       (pred_2 obj_18)
       (pred_2 obj_29)
       (pred_2 obj_08)
       (pred_2 obj_04)
       (pred_2 obj_01)
       (pred_2 obj_17)
       (pred_2 obj_12)
       (pred_2 obj_24)
       (pred_2 obj_13)
       (pred_2 obj_23)
       (pred_2 obj_21)
       (pred_2 obj_02)

       (pred_9  obj_19 obj_30)
       (pred_9  obj_27 obj_03)
       (pred_9  obj_09 obj_03)
       (pred_11 obj_19 obj_10)
       (pred_11 obj_27 obj_20)
       (pred_11 obj_09 obj_29)
       (pred_1 obj_16)
    )

    (:goal (and
       (pred_11 obj_19 obj_07)
       (pred_11 obj_09 obj_14)
    ))
(:constraints
  (always (not (pred_1 obj_15)))
)
)

; plan
1. (op_4 obj_16 obj_20)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_20)
   goals met: 0 of 2
2. (op_2 obj_20 obj_27)
   deleted: (pred_11 obj_27 obj_20) (pred_7)
   added: (pred_10 obj_27)
   goals met: 0 of 2
3. (op_4 obj_20 obj_07)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_07)
   goals met: 0 of 2
4. (op_3 obj_07 obj_27)
   deleted: (pred_10 obj_27)
   added: (pred_7) (pred_11 obj_27 obj_07)
   goals met: 0 of 2
5. (op_4 obj_07 obj_25)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_25)
   goals met: 0 of 2
6. (op_4 obj_25 obj_16)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_16)
   goals met: 0 of 2
7. (op_4 obj_16 obj_29)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_29)
   goals met: 0 of 2
8. (op_2 obj_29 obj_09)
   deleted: (pred_11 obj_09 obj_29) (pred_7)
   added: (pred_10 obj_09)
   goals met: 0 of 2
9. (op_4 obj_29 obj_16)
   deleted: (pred_1 obj_29)
   added: (pred_1 obj_16)
   goals met: 0 of 2
10. (op_4 obj_16 obj_25)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_25)
   goals met: 0 of 2
11. (op_5 obj_25 obj_11 obj_09 obj_03)
   deleted: (pred_6 obj_11)
   added: (pred_2 obj_11)
   goals met: 0 of 2
12. (op_4 obj_25 obj_07)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_07)
   goals met: 0 of 2
13. (op_3 obj_07 obj_09)
   deleted: (pred_10 obj_09)
   added: (pred_7) (pred_11 obj_09 obj_07)
   goals met: 0 of 2
14. (op_4 obj_07 obj_25)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_25)
   goals met: 0 of 2
15. (op_4 obj_25 obj_11)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_11)
   goals met: 0 of 2
16. (op_4 obj_11 obj_10)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_10)
   goals met: 0 of 2
17. (op_2 obj_10 obj_19)
   deleted: (pred_11 obj_19 obj_10) (pred_7)
   added: (pred_10 obj_19)
   goals met: 0 of 2
18. (op_4 obj_10 obj_11)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_11)
   goals met: 0 of 2
19. (op_4 obj_11 obj_25)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_25)
   goals met: 0 of 2
20. (op_4 obj_25 obj_07)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_07)
   goals met: 0 of 2
21. (op_1 obj_07 obj_09 obj_19)
   deleted: (pred_10 obj_19) (pred_11 obj_09 obj_07)
   added: (pred_10 obj_09) (pred_11 obj_19 obj_07)
   goals met: 1 of 2
22. (op_4 obj_07 obj_25)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_25)
   goals met: 1 of 2
23. (op_4 obj_25 obj_11)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_11)
   goals met: 1 of 2
24. (op_4 obj_11 obj_10)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_10)
   goals met: 1 of 2
25. (op_4 obj_10 obj_14)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_14)
   goals met: 1 of 2
26. (op_3 obj_14 obj_09)
   deleted: (pred_10 obj_09)
   added: (pred_7) (pred_11 obj_09 obj_14)
   goals met: 2 of 2
